{
  "index.intro.title": "Company Introduction",
  "index.intro.description1": "ETUC is a cutting-edge company committed to innovation and quality, dedicated to providing customers with advanced solutions and exceptional service experiences. We center on 'Exceeding Expectations and Creating the Future,' integrating technology and humanity to build a brand ecosystem that combines practicality and aesthetics.",
  "index.intro.description2": "ETUC is derived from 'Exceed Towards Unique Creativity,' symbolizing our continuous breakthroughs and pursuit of excellence. Our business covers technology research and development, creative design, brand consulting, digital marketing, and more. We aim to become an industry leader, creating long-term value for customers, partners, and society.",
  "index.intro.image1.alt": "One-click acceleration, unlimited traffic, super stable",
  "index.intro.image2.alt": "One-click acceleration, unlimited traffic, super stable",
  "index.brand.title": "Brand Philosophy",
  "index.brand.description1": "“Beyond Limits · Explore”",
  "index.brand.description2": "Beyond Limits: Break conventional thinking, challenge industry boundaries, and explore the unknown.",
  "index.brand.description3": "Explore: Maintain curiosity and discover trends with keen insight, leading change.",
  "index.business.title": "Business Philosophy",
  "index.business.description1-1": "Continuous Improvement",
  "index.business.description1-3": "Refine products and services with an extreme attitude, where details make excellence.",
  "index.business.description2-1": "Boundary Breaking",
  "index.business.description2-3": "Reject mediocrity and reconstruct industry standards with innovative thinking.",
  "index.business.description3-1": "Value Symbiosis",
  "index.business.description3-3": "Share growth with customers, employees, and partners to achieve multi-dimensional win-win.",
  "index.business.description4-1": "Long-termism",
  "index.business.description4-3": "Focus on sustainable competitiveness and influence, avoiding short-sighted pursuits.",
  "index.services.title": "Business Introduction",
  "index.services.service1.title": "Antique Items Recycling Trade",
  "index.services.service1.description": "Professionally recycle various antique luxury items, artworks, and collectibles, providing professional appraisal, reasonable valuation, and one-stop trading services. We are committed to finding new value for idle items and bringing precious items back to life.",
  "index.services.service1.image.alt": "Professional antique items appraisal and recycling services",
  "index.services.service2.title": "High-end Jewelry Design Customization",
  "index.services.service2.description": "Crafted by an internationally certified jewelry designer team, using rare gems and precious metals, offering personalized customization services. From design sketches to finished delivery, we present you with unique jewelry art.",
  "index.services.service2.image.alt": "Custom high-end jewelry design and sales",
  "index.services.service3.title": "High-end Personal Fitness Guidance",
  "index.services.service3.description": "National-level fitness coaches provide one-on-one exclusive training plans, combining sports science and nutrition to tailor fitness programs. Whether for muscle building, fat loss, or rehabilitation training, we help you achieve your ideal physique.",
  "index.services.service3.image.alt": "Personalized private fitness training services",
  "index.services.service4.title": "Professional Underwater Robot Rental",
  "index.services.service4.description": "Provide industrial-grade underwater robot rental services, equipped with high-definition cameras, robotic arms, and other professional modules, suitable for various scenarios such as underwater exploration, engineering inspection, and scientific research. Professional technical team provides full support.",
  "index.services.service4.image.alt": "Professional underwater robot rental services",
  "index.contact.careers.title": "View Positions",
  "index.contact.careers.description": "Latest positions · Apply now",
  "index.contact.email.title": "Contact Us by Email",
  "index.contact.email.description": "Direct email · Quick response"
}